#### Terraform fmt for dev `success`
#### Terraform init for dev `success`
#### Terraform validate for dev `success`
#### Terraform plan for dev `success`

<details><summary>Show plan result for dev </summary>

```

provision
proxmox_virtual_environment_vm.dev_vm: Refreshing state... [id=100]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # proxmox_virtual_environment_vm.dev_vm must be replaced
-/+ resource "proxmox_virtual_environment_vm" "dev_vm" {
      ~ id                      = "100" -> (known after apply)
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
      ~ mac_addresses           = [
          - "BC:24:11:DF:C4:FD",
        ] -> (known after apply)
        name                    = "dev"
      ~ network_interface_names = [] -> (known after apply)
        # (20 unchanged attributes hidden)

      ~ cpu {
          - flags        = [] -> null
            # (7 unchanged attributes hidden)
        }

      + disk { # forces replacement
          + cache             = "none"
          + datastore_id      = "local-zfs"
          + file_format       = (known after apply)
          + interface         = "scsi0"
          + iothread          = false
          + path_in_datastore = (known after apply)
          + size              = 128
          + ssd               = false
        }

      ~ initialization {
          - interface    = "ide2" -> null
            # (1 unchanged attribute hidden)

          ~ user_account {
              - keys     = [] -> null
              ~ password = (sensitive value)
                # (1 unchanged attribute hidden)
            }

            # (2 unchanged blocks hidden)
        }

      ~ network_device {
          ~ mac_address = "BC:24:11:DF:C4:FD" -> (known after apply)
            # (8 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # random_password.vm_password will be created
  + resource "random_password" "vm_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 12
      + lower       = true
      + min_lower   = 2
      + min_numeric = 2
      + min_special = 0
      + min_upper   = 2
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

Plan: 2 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + vm_password = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @vpletea, Action: `pull_request`*